{
    "Openness": {
      "1": {
        "indicator": "Predictable, always uses same tools and TTPs",
        "defense": "IOC, signatures and classic detection very effective."
      },
      "2": {
        "indicator": "Introduces small variations, rarely new approaches",
        "defense": "IOC + static rules still very effective; patch management essential."
      },
      "3": {
        "indicator": "Uses new tools for the group, but known in the community",
        "defense": "Traditional CTI works; prioritize detection by known IOCs and TTPs."
      },
      "4": {
        "indicator": "Adapts and combines known TTPs in creative and complex ways",
        "defense": "Hunting on unusual attack chains; analyze correlations between already known techniques."
      },
      "5": {
        "indicator": "Innovative, pioneer, develops 0-days, creates unprecedented TTPs",
        "defense": "IOC not useful alone; use behavioral detection, deception, continuous hunting."
      }
    },
    "Conscientiousness": {
      "1": {
        "indicator": "Impulsive and chaotic, makes mistakes easily",
        "defense": "High probability of early detection; reinforce basic IDS/IPS."
      },
      "2": {
        "indicator": "Basic planning but inconsistent in covering tracks",
        "defense": "Detection in logs and simple correlations; basic SIEM alerts can catch it."
      },
      "3": {
        "indicator": "Follows a plan but may make long-term security mistakes",
        "defense": "Look for reused infrastructure; hunting on repetition patterns."
      },
      "4": {
        "indicator": "Very methodical, disciplined, carefully erases tracks",
        "defense": "Review logs in depth and long-term; detection of stealth patterns and clean lateral movements."
      },
      "5": {
        "indicator": "Extremely meticulous; even capable of planting false noise",
        "defense": "Review persistence, long correlations; don't trust false positives/negatives → long-term threat hunting."
      }
    },
    "Extraversion": {
      "1": {
        "indicator": "Ghost: operates in total secrecy, never attributes",
        "defense": "Difficult to detect by noise; depends on technical intelligence (logs and CTI)."
      },
      "2": {
        "indicator": "Functional: communicates only if necessary (extortion)",
        "defense": "Monitor ransom communications; analysis of extortion emails."
      },
      "3": {
        "indicator": "Passive: doesn't seek fame, but may confirm authorship in forums",
        "defense": "Monitor underground forums; HUMINT/Dark Web intelligence."
      },
      "4": {
        "indicator": "Suggestive: leaves 'subtle clues' or signatures",
        "defense": "Look for atypical indicators or 'marks' in systems; correlate with known campaigns."
      },
      "5": {
        "indicator": "Notorious, seeks fame, logos and statements",
        "defense": "Monitor forums, leaks and propaganda channels; activate OSINT/CTI intelligence to anticipate campaigns."
      }
    },
    "Agreeableness": {
      "1": {
        "indicator": "Ruthless, no qualms about attacking critical infrastructure",
        "defense": "Prepare critical continuity plans; segment essential assets."
      },
      "2": {
        "indicator": "Antagonistic: cold/threatening, seeks maximum benefit",
        "defense": "Prepare negotiation teams; financial and continuity resilience."
      },
      "3": {
        "indicator": "Transactional: 'professional' tone, attacks corporations",
        "defense": "Evaluate corporate security posture; prioritize defense in high-value companies."
      },
      "4": {
        "indicator": "Has 'rules': avoids attacking certain sectors",
        "defense": "Map typical targets and possible exclusions; threat intelligence focused on specific sectors."
      },
      "5": {
        "indicator": "'Principled': attacks only what it considers immoral",
        "defense": "Predictable in targets (ethically defined sectors); can be profiled by ideological narrative."
      }
    },
    "Neuroticism": {
      "1": {
        "indicator": "Stable: withdraws in controlled manner without errors",
        "defense": "Detecting it doesn't generate escalation; less risk of impulsive counterattacks."
      },
      "2": {
        "indicator": "Resilient: if a tool is blocked, pauses and changes calmly",
        "defense": "Detection of sequential alternative techniques; hunt switching patterns."
      },
      "3": {
        "indicator": "Reactive: temporary disorganization but reorganizes",
        "defense": "Detect anomalous activity spikes after blocks; hunting improvisations."
      },
      "4": {
        "indicator": "Volatile: if access is lost, tries to recover it aggressively",
        "defense": "Prepare for escalation and aggressive responses after detection; reinforced containment in post-intrusion phases."
      },
      "5": {
        "indicator": "Unstable, vengeful, makes serious mistakes",
        "defense": "Prepare for noisy escalation after detection; rapid containment and monitoring of impulsive counterattacks."
      }
    },
    "Machiavellianism": {
      "1": {
        "indicator": "Pure technical: exploits software, no human deception",
        "defense": "Focus on patches, WAF, technical hardening; lower insider risk."
      },
      "2": {
        "indicator": "Basic deception: generic phishing",
        "defense": "User awareness, spam filters and mass phishing sufficient."
      },
      "3": {
        "indicator": "Hybrid: technical attack with one or two deception tactics",
        "defense": "Mixed controls: hardening + phishing awareness."
      },
      "4": {
        "indicator": "Strategist: central manipulation, sustained credible pretexts",
        "defense": "Controls against targeted spear phishing, social media monitoring and insider anomalies."
      },
      "5": {
        "indicator": "Master manipulator, 100% human deception operations",
        "defense": "Anti-phishing training, insider protection, fake profile detection, social media monitoring."
      }
    },
    "Narcissism": {
      "1": {
        "indicator": "Functional: chooses victims by ease, not status",
        "defense": "Protect most vulnerable assets; general posture analysis."
      },
      "2": {
        "indicator": "Technical pride in private forums",
        "defense": "Monitor underground forums to detect early signals."
      },
      "3": {
        "indicator": "Status-driven: chooses high-profile targets",
        "defense": "Prioritize defense in critical infrastructures and prestige objectives."
      },
      "4": {
        "indicator": "Boastful: leaves messages/signatures to show superiority",
        "defense": "Review SIEM for embedded messages, comments or unusual modifications in systems."
      },
      "5": {
        "indicator": "Exhibitionist, publicly ridicules",
        "defense": "Monitor leaks, dark web and statements; reputation defenses; early detection in 'theatrical' intrusions."
      }
    },
    "Psychopathy": {
      "1": {
        "indicator": "Risk-averse: prioritizes stealth, avoids noisy techniques",
        "defense": "Difficult to detect by alerts; requires very subtle behavioral hunting."
      },
      "2": {
        "indicator": "Cautious: avoids risks, except minor and controlled ones",
        "defense": "Requires advanced hunting; difficult to detect by noise → use EDR/XDR."
      },
      "3": {
        "indicator": "Calculated risk: uses some noisy technique for high reward",
        "defense": "Prepare response to high-impact incidents; correlations with unusual events."
      },
      "4": {
        "indicator": "Risky: trusts in evading capture, frequently uses dangerous TTPs",
        "defense": "Traditional detection (IDS/IPS) still useful; reinforce correlations with 'noisy' alerts."
      },
      "5": {
        "indicator": "Reckless, uses noisy TTPs without calculation",
        "defense": "High value of traditional detection (IDS/IPS), as it doesn't care about hiding tracks."
      }
    },
    "Sadism": {
      "1": {
        "indicator": "Indifferent: if victim pays, returns files",
        "defense": "Backup strategy + recovery plan may be sufficient."
      },
      "2": {
        "indicator": "Mocking: condescending language, but payment remains the objective",
        "defense": "Prepare crisis communication against extortion attacks."
      },
      "3": {
        "indicator": "Power game: pressures, renegotiates, raises prices",
        "defense": "Prepare negotiation strategy and alternative backup plans."
      },
      "4": {
        "indicator": "Cruel: prolongs suffering, false hopes, humiliations",
        "defense": "Resilience and negotiation plans; psychological/communication preparation in incidents."
      },
      "5": {
        "indicator": "Tormentor: destroys data for pleasure",
        "defense": "Immutable backups and essential resilience plans: don't trust negotiation."
      }
    }
  }
  